evilgenius79/Tab5-scan-tool/sdkconfig.defaults
# =============================================================================
#  Default sdkconfig for Tab5 Scan Tool (ESP32-P4 / M5Stack Tab5)
#  These values are applied on a fresh `idf.py set-target esp32p4`.
# =============================================================================

# --- Target ------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# --- CPU ---------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_FREERTOS_HZ=1000

# --- Flash -------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (octal, 32 MB on Tab5) --------------------------------------------
# LVGL framebuffers and CAN ring buffers are allocated from PSRAM.
# IMPORTANT: do NOT execute code / place rodata in PSRAM. The MIPI-DSI panel
# DMAs its framebuffer out of PSRAM at ~110 MB/s; letting the CPU also fetch
# instructions/rodata from PSRAM starves the DSI and causes
# "lcd.dsi.dpi: can't fetch data ... underrun happens" (a blue/garbled screen).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# 200 MHz octal PSRAM is required to feed the 1280x720 DSI panel (~120 MB/s).
# On the ESP32-P4 this speed is gated behind the experimental-features flag;
# without it Kconfig silently drops 200M and PSRAM falls back to 20 MHz, which
# starves the DSI ("...can't fetch data... underrun") -> blue/garbled screen.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=n
CONFIG_SPIRAM_RODATA=n
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# 128-byte L2 cache lines improve PSRAM burst throughput for the framebuffer DMA.
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- USB Host (OTG-HS) -------------------------------------------------------
# The OBDLink EX enumerates as an FTDI CDC device on the P4 USB 2.0 HS port.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# --- FreeRTOS ----------------------------------------------------------------
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# --- Main task / stacks ------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- FATFS for the microSD CSV logger ---------------------------------------
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# --- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Compiler ----------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# The esp_usb VCP component (VCP::open) uses C++ exceptions internally, so they
# must stay enabled even though our own code avoids throwing.
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# --- LVGL 9 (configured via Kconfig in the managed component) ---------------
# 16-bit color matches the Tab5 DSI panel pipeline.
CONFIG_LV_COLOR_DEPTH_16=y
# Fonts used across the UI (defaults only enable Montserrat 14).
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# Widgets the screens rely on.
CONFIG_LV_USE_TABLE=y
CONFIG_LV_USE_CHART=y
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_TABVIEW=y
# Use esp_timer as LVGL's tick source (esp_lvgl_port wires this up).
CONFIG_LV_TICK_CUSTOM=y
# Larger LVGL heap for the 1280x720 widget tree, drawn from PSRAM.
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_USE_PERF_MONITOR=n

# --- Crash diagnostics -------------------------------------------------------
# Panic (with backtrace) if a task starves the watchdog for 5 s, instead of
# letting the 9 s RTC watchdog reset silently ("other watchdog"). The backtrace
# is saved to the coredump flash partition for headless (in-vehicle) retrieval
# via `idf.py coredump-info` / `coredump-debug`.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_LOGS=y
